# Файл содержит последовательность неотрицательных целых чисел, не
# превышающих 10 000. Назовём парой два идущих подряд элемента
# последовательности. Определите количество пар, в которых ровно один из двух
# элементов делится на 3, а модуль их разности меньше наименьшего нечётного
# элемента последовательности. В ответе запишите два числа: сначала количество
# найденных пар, а затем – максимальный модуль разности элементов таких пар.
with open('17.txt') as f:
    a = list(map(int, f.readlines()))
# print(a)
mn = 10000
for el in a:
    if el % 2:
        mn = min(mn, el)
cnt, mx = 0, 0
for i in range(len(a) - 1):
    if ((a[i] % 3 == 0 and a[i + 1] % 3 != 0 or a[i] % 3 != 0 and a[i + 1] % 3 == 0) and
            abs(a[i] - a[i + 1]) < mn):
        cnt += 1
        mx = max(mx, abs(a[i] - a[i + 1]))
print(cnt, mx)  # 748 826
