# Ниже записана программа, которая вводит натуральное число x, выполняет преобразования,
# а затем выводит два числа. Известно, что при вводе некоторого x программа первым вывела
# число 6300. Укажите наибольшее возможное значение числа, выведенного вторым.
mxb = 0
for i in range(1, 1000000):
    x = i  # int(input())
    a = 1
    b = 0
    while x > 0:
        d = x % 10
        a *= d
        if d > 5:
            b += d
        x //= 10
    # print(a, b)
    if a == 6300:
        print(b)
        mxb = max(mxb, b)
print(mxb)  # 19
