# Текстовый файл содержит только заглавные буквы латинского алфавита
# (ABC…Z). Определите количество групп из идущих подряд не менее
# 12 символов, которые начинаются и заканчиваются буквой A, не содержат
# других букв A (кроме первой и последней) и содержат не меньше двух букв B.
with open('24.txt') as f:
    text = f.read()
# print(text)
words = text.split('A')
cnt = 0
for w in words[1:-1]:
    if len(w) >= 10 and w.count('B') >= 2:
        cnt += 1
print(cnt)  # 10492
