# Напишите программу, которая выводит слово 'Python' 1234 раза подряд
# (только буквы, без кавычек). Обратите внимание на регистр.
print('Python' * 1234)
