# Напишите программу, которая будет выводить на экран число,
# равное квадрату числа, записанного при помощи 123 единиц.
print(int('1' * 123) ** 2)
