# Число 15^10 записали 10 раз подряд. Полученное число возвели в квадрат.
# Напишите программу, которая повторит указанные действия и выведет полученный результат.
print(int(str(15 ** 10) * 10) ** 2)
