# Сумма
# Напишите программу, которая будет считывать два целых числа
# (каждое в отдельной строке) и выводить их сумму.
a = int(input())
b = int(input())
print(a + b)
