# Обмен значений — 1
# Напишите программу, которая считывает значения двух переменных a и b,
# затем меняет их значения местами и выводит их значения на экран.
# Начало и конец программы уже заданы в системе, вам необходимо сдать фрагмент кода,
# который будет вставлен системой в программу вместо многоточия.
# Использовать арифметические операции в этой задаче нельзя.

a = int(input())
b = int(input())

# a, b = b, a

# t = a
# a = b
# b = t

a += b
b = a - b
a -= b

print(a)
print(b)
