# # Предпоследняя цифра
# Дано натуральное число. Найдите число десятков в его десятичной записи (то есть предпоследнюю
# цифру его десятичной записи). Если заданное число является однозначным, то необходимо вывести 0.
n = int(input())
print(n % 100 // 10)
