# Сумма цифр
# Дано четырёхзначное число. Найдите сумму его цифр.
n = int(input())
print(n % 10 + n % 100 // 10 + n % 1000 // 100 + n // 1000)
