# Электронные часы
# С начала некоторых суток прошло n минут. Определите, сколько часов и минут будут показывать
# электронные часы в этот момент.
# На вход программе подается целое неотрицательное число n.
# Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59).
n = int(input())
print(n // 60, n % 60)
