# Яша плавает в бассейне
# Яша плавал в бассейне размером N×M метров и устал. В этот момент он обнаружил, что находится на
# расстоянии x метров от одного из длинных бортиков (не обязательно от ближайшего) и y метров от
# одного из коротких бортиков. Какое минимальное расстояние должен проплыть Яша, чтобы выбраться из
# бассейна на бортик? Обратите внимание, что изначально неизвестно, какой из бортиков
# (длиной N или M метров) является коротким.
n = int(input())
m = int(input())
x = int(input())
y = int(input())
if n < m:
    n, m = m, n
print(min(x, y, m - x, n - y))
