# Узник замка Иф
# За многие годы заточения узник замка Иф проделал в стене прямоугольное отверстие размером D×E.
# Замок Иф сложен из кирпичей размером A×B×C. Определите, сможет ли узник выбрасывать кирпичи в море
# через это отверстие, если стороны кирпича должны быть параллельны сторонам отверстия.
a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = int(input())
mn = min(a, b, c)
a, b = a + b + c - max(a, b, c) - mn, mn
if d < e:
    d, e = e, d
if a <= d and b <= e:
    print('YES')
else:
    print('NO')
