# Сколько совпадает чисел
# Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из
# чисел: 3 (если все числа совпадают), 2 (если два совпадает) или 0 (если все числа различны).
a = int(input())
b = int(input())
c = int(input())
if a == b:
    if a == c:
        print(3)
    else:
        print(2)
else:
    if a == c or b == c:
        print(2)
    else:
        print(0)
