# Упорядочить 3 числа
# Дано три числа. Упорядочите их в порядке неубывания. Программа должна считывать три числа a, b, c,
# затем программа должна менять их значения так, чтобы стали выполнены условия a⩽b⩽c, затем программа
# выводит тройку a, b, c. Постарайтесь обойтись небольшим числом сравнений переменных между собой.
# Логические операции and или or использовать нельзя.
a = int(input())
b = int(input())
c = int(input())
if a > b:
    a, b = b, a
if b > c:
    b, c = c, b
if a > b:
    a, b = b, a
print(a, b, c)
