# Апельсины бочками
# Бизнесмен Василий после прочтения известной книги решил открыть новый бизнес — отгружать апельсины
# бочками. Партнёрам важно знать, сколько именно бочек апельсинов отгружается каждый день.
# Мобильный телефон Василия поддерживает только транслит, поэтому он передаёт сообщения вида
# «n bochek». Например, «3 bochki» или «1 bochka».
# Напишите программу, которая выбирает правильное слово (из «bochka» , «bochek» , «bochki» )
# в зависимости от значения n.
# for i in range(1000):
#     n = i
n = int(input())
if 10 <= n % 100 <= 19 or 5 <= n % 10 <= 9 or n % 10 == 0:
    print(n, 'bochek')
elif n % 10 == 1:
    print(n, 'bochka')
else:
    print(n, 'bochki')
