# Цифры числа
# Дано 10-‍значное число. Выведите все цифры этого числа в обратном порядке по одной.
n = int(input())
for i in range(10):
    print(n % 10, end=' ')
    n //= 10
