# Диофантово уравнение
# Даны числа a, b, c, d. Выведите в порядке возрастания все целые числа от 0 до 1000 включительно,
# которые являются корнями уравнения a⋅x^3+b⋅x^2+c⋅x+d=0.
a = int(input())
b = int(input())
c = int(input())
d = int(input())
for x in range(1001):
    if a * x ** 3 + b * x ** 2 + c * x + d == 0:
        print(x)
