# Трискайдекафобия
# Трискайдекафобия — боязнь числа 13. В особо сложных формах пациент боится и всех чисел, кратных 13.
# Дано число N. Выведите все целые числа по возрастанию, начиная с числа N,
# пока не встретится число, кратное 13. Его выводить не нужно.
n = int(input())
while n % 13 != 0:
    print(n)
    n += 1
