# Номер числа Фибоначчи
# Последовательность Фибоначчи определяется так: ϕ0=0,ϕ1=1,ϕn=ϕn−1+ϕn−2
# Дано натуральное число A. Определите, каким по счету числом Фибоначчи оно является, то есть
# выведите такое число n, что ϕn=A. Если A не является числом Фибоначчи, выведите число −1.
a = int(input())
f0, f1 = 0, 1
c = 0
while f0 < a:
    f0, f1 = f1, f0 + f1
    c += 1
if f0 == a:
    print(c)
else:
    print(-1)
