# Второй минимум
# Последовательность состоит из натуральных чисел и завершается числом 0. Определите
# значение второго минимального по величине элемента в этой последовательности, то есть
# элемента, который будет наименьшим, если из последовательности удалить наименьший элемент.
# Последнее число 0 не учитывается. Гарантируется, что в последовательности есть хотя бы
# два элемента (кроме завершающего числа 0).
n = int(input())
m1, m2 = 0, 0
while n != 0:
    if n <= m1 or m1 == 0:
        m2 = m1
        m1 = n
    elif n < m2 or m2 == 0:
        m2 = n
    n = int(input())
print(m2)
