# Количество элементов, которые больше предыдущего
# Последовательность состоит из натуральных чисел и завершается числом 0.
# Определите, сколько элементов этой последовательности больше предыдущего элемента.
prev = int(input())
n = int(input())
count = 0
while n != 0:
    if n > prev:
        count += 1
    prev, n = n, int(input())
print(count)
