# Среднее значение последовательности
# Определите среднее значение всех элементов последовательности, завершающейся числом 0.
# Сам ноль в последовательность не входит.
# Использовать массивы в данной задаче нельзя.
n = int(input())
summ, count = 0, 0
while n != 0:
    count += 1
    summ += n
    n = int(input())
print(summ / count)
