# Выдача сдачи - 2
# Имеется неограниченное количество монет в 1, 2, 5, 10 рублей.
# Определите, сколькими способами можно выдать сдачу в n рублей.
# Например, 5 рублей можно выдать четырьмя способами: 5=2+2+1=2+1+1+1=1+1+1+1+1.
summ = int(input())
s5 = 0
ans = 0
while s5 <= summ:
    summ1 = summ - s5
    ans += (summ1 // 2 + 1) * (s5 // 10 + 1)
    s5 += 5
print(ans)
