# Значение выражения
# Дана строка, состоящая из n цифр (т.е. однозначных чисел), между которыми стоит n−1
# знак операции, каждый из которых может быть либо +, либо −.
# Вычислите значение данного выражения.
s = input()
t = int(s[0])
for i in range(1, len(s) - 1):
    if s[i] == '+':
        t += int(s[i + 1])
    elif s[i] == '-':
        t -= int(s[i + 1])
print(t)
