# Палиндром
# Напишите программу, которая определяет, является ли введённое слово (без пробелов)  палиндромом,
# то есть верно ли, что оно читается одинаково слева направо и справа налево.
s = input()
if s == s[::-1]:
    print('YES')
else:
    print('NO')
