# Совпадающие начало и конец
# Дана строка. Требуется найти самую длинную её подстроку, у которой совпадает первый и
# последний символы. Если подходит несколько подстрок, то выведите любую из них.
s = input()
im1, im2 = 0, 0
n = len(s)
for i in range(n):
    for j in range(n - 1, i - 1, -1):
        if s[i] == s[j]:
            if j - i > im2 - im1:
                im1, im2 = i, j
            break
print(s[im1:im2 + 1])
