# Замена внутри фрагмента
# Дана строка. Замените в этой строке все появления буквы h на букву H,
# кроме первого и последнего вхождения.
s = input()
h1, h2 = s.find('h'), s.rfind('h')
print(s[:h1 + 1] + s[h1 + 1:h2].replace('h', 'H', ) + s[h2:])
