# Вставка символов
# Дана строка. Получите новую строку, вставив между всеми парами соседних символов
# исходной строки символ ∗.
s = input()
ans = ''
for c in s:
    ans += c + '*'
print(ans[:-1])
