# Список квадратов
# Дано число N. Выведите N квадратов чисел от 1 до N (включительно) в формате
# [1, 4, 9, 16,…, N**2]. Используйте функцию print() для вывода списка.
n = int(input())
ans = [(i + 1) ** 2 for i in range(n)]
print(ans)
