# Чётные элементы
# Выведите все чётные элементы списка.
print(*[x for x in input().split() if x[-1] in '02468'])
