# Чётные индексы
# Выведите все элементы списка с чётными индексами (то есть A[0],A[2],A[4],...).
# Программа должна быть эффективной и не выполнять лишних действий!
print(*input().split()[::2])
