# Наименьший положительный
# Выведите значение наименьшего из всех положительных элементов в списке.
# Известно, что в списке есть хотя бы один положительный элемент.
a = list(map(int, input().split()))
mn = 0
for el in a:
    if el > 0 and (el < mn or mn == 0):
        mn = el
print(mn)
