# Переставить в обратном порядке
# Выведите элементы данного списка в обратном порядке.
print(*input().split()[::-1])
