# Количество различных элементов — 2
# Дан список. Посчитайте, сколько в нём различных элементов, не изменяя самого списка.
a = input().split()
print(len(set(a)))
