# Уникальные элементы
# Дан список. Выведите те его элементы, которые встречаются в списке только один раз.
# Элементы нужно выводить в том порядке, в котором они встречаются в списке. В данной
# задаче запрещено пользоваться всеми операциями над списками (find, count, index и так далее).
a = input().split()
ans = []
for i in range(len(a)):
    if a[i] not in a[:i] + a[i + 1:]:
        ans += [a[i]]
print(*ans)
