# Самое частое число
# Дан список. Не изменяя его и не используя дополнительные списки, определите,
# какое число в этом списке встречается чаще всего.
# Если таких чисел несколько, выведите любое из них.
a = input().split()
ans = 0
mx = 0
for x in set(a):
    c = a.count(x)
    if c > mx:
        mx = c
        ans = x
print(ans)
