# Количество совпадающих пар
# Дан список чисел. Посчитайте, сколько в нём пар элементов, равных друг другу.
# Считается, что любые два элемента, равные друг другу, образуют одну пару,
# которую необходимо посчитать.
a = input().split()
n = len(a)
ans = 0
for i in range(n - 1):
    for j in range(i + 1, n):
        if a[i] == a[j]:
            ans += 1
print(ans)
