# Снежинка
# Дано нечётное число n. Создайте двумерный массив из n×n элементов, заполнив его
# символами «.» (каждый элемент массива является строкой из одного символа).
# Затем заполните символами «∗» среднюю строку массива, средний столбец массива,
# главную диагональ и побочную диагональ. Для этого не нужно использовать
# вложенные циклы.
# В результате символы «звёздочка» в массиве должны образовывать изображение
# снежинки. Выведите полученный массив на экран, разделяя элементы массива
# пробелами.
n = int(input())
a = [['.'] * n for _ in range(n)]
for i in range(n):
    a[i][i] = '*'
    a[i][n - i - 1] = '*'
    a[n // 2][i] = '*'
    a[i][n // 2] = '*'
for row in a:
    print(*row)
