# Симметричен ли массив?
# Дано число n и массив размером n×n. Проверьте, является ли этот массив симметричным
# относительно главной диагонали. Выведите слово YES, если массив симметричный,
# и слово NO в противном случае.
n = int(input())
a = [input().split() for _ in range(n)]
for i in range(1, n):
    for j in range(i):
        if a[i][j] != a[j][i]:
            print('NO')
            exit(0)
print('YES')
