# Транспонировать квадратную матрицу
# Дан двумерный массив размером n×n. Транспонируйте его и результат запишите
# в этот же массив. Вспомогательный массив использовать нельзя.
n = int(input())
a = [input().split() for _ in range(n)]
for i in range(1, n):
    for j in range(i):
        a[i][j], a[j][i] = a[j][i], a[i][j]
for r in a:
    print(*r)
