# Золото
# Мудрец ходит по комнате размера n×m клеток. В каждой клетке комнаты лежит заданное
# количество золота. Проходя по клетке мудрец забирает всё золото с неё. Зная план комнаты
# и маршрут мудреца, посчитайте сколько золота он собрал. В задаче не гарантируется, что
# мудрец не проходил по одной и той же клетке более одного раза.
n, m = map(int, input().split())
a = [list(map(int, input().split())) for _ in range(n)]
x = int(input())
ans = 0
for _ in range(x):
    i, j = map(int, input().split())
    ans += a[i - 1][j - 1]
    a[i - 1][j - 1] = 0
print(ans)
