# Шахматная доска
# Даны два числа n и m. Создайте двумерный массив размером n×m и заполните его
# символами 1 и 0 в шахматном порядке. В левом верхнем углу должна стоять единица.
# Данную задачу необходимо решить с помощью генератора, который заполнит матрицу A.
# Вы должны отправить на проверку единственную строку вида: A = [текст генератора]
n, m = map(int, input().split())
a = [[(i + j + 1) % 2 for j in range(m)] for i in range(n)]
for row in a:
    print(*row, sep='\t')
