# Квадранты
# Дано число n. Создайте массив размером n×n и заполните его по следующему правилу.
# На главной и побочных диагоналях стоят нули, эти диагонали делят массив на четыре части.
# В верхней части записаны единицы, в правой записаны двойки, в нижней записаны тройки,
# в левой записаны четверки.
# Данную задачу необходимо решить с помощью генератора, который заполнит матрицу A.
# Вы должны отправить на проверку единственную строку вида: A = [текст генератора]
n = int(input())
a = [[(4 * (i > j and j + i < n - 1) +
       1 * (i < j and j + i < n - 1) +
       3 * (i > j and j + i > n - 1) +
       2 * (i < j and j + i > n - 1))
      for j in range(n)] for i in range(n)]
for row in a:
    print(*row, sep='\t')
