# Количество маршрутов в прямоугольной таблице
# В прямоугольной таблице N×M вначале игрок находится в левой верхней клетке.
# За один ход ему разрешается перемещаться в соседнюю клетку либо вправо, либо вниз
# (влево и вверх перемещаться запрещено). Посчитайте, сколько есть способов у игрока
# попасть в правую нижнюю клетку.
n, m = map(int, input().split())
a = [[1] * m for i in range(n)]
for i in range(1, n):
    for j in range(1, m):
        a[i][j] = a[i - 1][j] + a[i][j - 1]
# for row in a:
#     print(*row, sep='\t')
print(a[-1][-1])
