# Cамый дешёвый путь
# В каждой клетке прямоугольной таблицы N×M записано некоторое число. Изначально игрок
# находится в левой верхней клетке. За один ход ему разрешается перемещаться в соседнюю
# клетку либо вправо, либо вниз (влево и вверх перемещаться запрещено). При проходе через
# клетку с игрока берут столько килограммов еды, какое число записано в этой клетке
# (еду берут также за первую и последнюю клетки его пути).
# Требуется найти минимальный вес еды в килограммах,
# отдав которую игрок может попасть в правый нижний угол.
n, m = map(int, input().split())
a = [list(map(int, input().split())) for i in range(n)]
b = [[0] * m for _ in range(n)]
b[0][0] = a[0][0]
for i in range(1, n):
    b[i][0] = a[i][0] + b[i - 1][0]
for j in range(1, m):
    b[0][j] = a[0][j] + b[0][j - 1]
for i in range(1, n):
    for j in range(1, m):
        b[i][j] = a[i][j] + min(b[i][j - 1], b[i - 1][j])
# for row in b:
#     print(*row, sep='\t')
print(b[-1][-1])
