# Шашку — в дамки
# На шахматной доске (8×8) стоит одна белая шашка.
# Сколькими способами она может пройти в дамки?
# (Белая шашка ходит по диагонали: на одну клетку вверх-вправо или вверх-влево.
# Шашка проходит в дамки, если попадает на верхнюю горизонталь.)
m, n = map(int, input().split())
a = [[0] * 8 for i in range(8)]
a[8 - n][m - 1] = 1
for i in range(7 - n, -1, -1):
    for j in range(8):
        if 0 <= j - 1 < 8:
            a[i][j] += a[i + 1][j - 1]
        if 0 <= j + 1 < 8:
            a[i][j] += a[i + 1][j + 1]
# for row in a:
#     print(*row, sep='\t')
print(sum(a[0]))
