# Наибольшее число
# Напишите программу, которая определяет, есть ли во введённой строке десятичные цифры,
# и выводит наибольшее число, которое можно составить из этих цифр. Ведущих нулей в
# числе быть не должно (за исключением числа 0, запись которого содержит ровно одну
# цифру). Если цифр нет, программа должна вывести число −1.
# Использовать встроенные сортировки запрещено.
s = input()
cnt = [0] * 10
for c in s:
    if c.isdigit():
        cnt[int(c)] += 1
ans = []
for i in range(9, -1, -1):
    ans += [i] * cnt[i]
if ans:
    print(*ans, sep='')
else:
    print(-1)
