# Сортировка по сумме цифр
# Напишите программу, которая сортирует натуральные числа в массиве по убыванию суммы
# цифр десятичной записи числа. При равенстве сумм цифр числа должны сохранить
# исходный порядок.
n = int(input())
a = list(map(int, input().split()))
a.sort(key=lambda x: -sum(map(int, str(x))))
print(*a)
